{
  "categories": [
    {
      "id": "geometry-dash",
      "name": "Geometry Dash",
      "slug": "geometry-dash",
      "description": "Play Geometry Dash games online free - rhythm-based platformers with challenging obstacles and electronic music.",
      "longDescription": "Geometry Dash is a series of rhythm-based action platformer games that challenge your reflexes and timing skills. Our collection features all the popular Geometry Dash versions including Geometry Dash Lite, the original Geometry Dash, Geometry Dash World, SubZero, Meltdown, Wave, Spam, and Breeze. Each game combines precise platforming with synchronized electronic music, creating an immersive gaming experience. Players navigate geometric characters through increasingly difficult levels filled with spikes, platforms, and moving obstacles. The games feature simple one-touch controls but require perfect timing to master. Whether you're a beginner looking to start with Geometry Dash Lite or an expert ready for the intense challenges of Geometry Dash Spam, our collection offers something for every skill level. These rhythm-based platformers have gained massive popularity for their addictive gameplay, memorable soundtracks, and the satisfaction of finally completing a difficult level after many attempts.",
      "isTopLevel": true,
      "gameCount": 30
    },
    {
      "id": "google-games",
      "name": "Google Games",
      "slug": "google-games",
      "description": "Free Google games collection - classic arcade games including Pac-Man, Snake, Doodle Baseball and more.",
      "longDescription": "Google Games represents a curated collection of classic arcade games that have been reimagined and optimized by Google. Our selection includes iconic titles that have entertained millions of players worldwide. Featured games include the legendary Pac-Man, where you navigate mazes eating dots while avoiding colorful ghosts; the addictive Snake Game that defined early mobile gaming; Google's charming Doodle Baseball with hand-drawn graphics and intuitive gameplay; the challenging Google Minesweeper with modern design improvements; Atari Breakout for classic brick-breaking action; Basketball for arcade-style shooting fun; and the famous Dinosaur Game (Chrome Dino) that appears when your internet connection fails. These games showcase Google's commitment to preserving gaming history while making classic titles accessible to modern audiences. Each game maintains the simple, pick-up-and-play nature that made the originals so popular, while benefiting from improved graphics, smooth controls, and browser-based convenience. Perfect for quick gaming sessions, these timeless classics offer instant entertainment without downloads or installations.",
      "isTopLevel": true,
      "gameCount": 7
    },
    {
      "id": "js13k-games",
      "name": "JS13K Games",
      "slug": "js13k-games",
      "description": "Play free online JS13K Games - small, minimalist browser games built with JavaScript.",
      "longDescription": "JS13K Games is a curated collection of small, minimalist browser games built with JavaScript. Each game is designed to be played in just 13 kilobytes of code, challenging players to create innovative and engaging experiences within tight constraints. Our selection includes a variety of genres, from puzzle games to action-packed adventures, all optimized for quick, on-the-go gaming. The games are optimized for performance and accessibility, ensuring they run smoothly on all devices. Whether you're looking for a quick challenge or a relaxing gaming session, our JS13K Games collection offers a diverse range of experiences that can be enjoyed anywhere, anytime.",
      "isTopLevel": true,
      "gameCount": 10
    }
  ]
} 